Pandas

In [2]:
import pandas as pd

In [3]:
print(pd.__version__)

2.1.0

In [4]:
a = pd.Series([2,3,4,5], index=['a','b','c','d'])
#Series handles 1d array and we can index accordingly

In [6]:
type(a.values) #pandas create a numpy array datatype

numpy.ndarray

In [7]:
type(a)

pandas.core.series.Series

In [8]:
a.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [10]:
a['a']

2

In [11]:
#slicing in pandas
a['a':'c']

a    2
b    3
c    4
dtype: int64

In [ ]:
"""
one way to create pandas series is by making a series and index
like we did, another way is to make python dictionary and pass 
that dictionary into pandas series object
"""

In [13]:
grades_dict = {'a':4, 'b':3.5, 'c':3, 'd':2.5}
grades = pd.Series(grades_dict)

In [14]:
grades.values

array([4. , 3.5, 3. , 2.5])

In [15]:
marks_dict = {'a':85, 'b':75, 'c':65, 'd':55}
marks = pd.Series(marks_dict)

In [16]:
marks

a    85
b    75
c    65
d    55
dtype: int64

In [17]:
marks['a']

85

In [18]:
marks[0:2]

a    85
b    75
dtype: int64

In [19]:
#dataFrame
d = pd.DataFrame({'Marks': marks, 'Grades': grades})

In [20]:
d

   Marks  Grades
a     85     4.0
b     75     3.5
c     65     3.0
d     55     2.5

In [23]:
#transpose of above dataFrame
d.T

           a     b     c     d
Marks   85.0  75.0  65.0  55.0
Grades   4.0   3.5   3.0   2.5

In [21]:
d.values

array([[85. ,  4. ],
       [75. ,  3.5],
       [65. ,  3. ],
       [55. ,  2.5]])

In [24]:
d.values[2,0] #it will access row 3 column 1 value, i.e. 65

65.0

In [25]:
d.columns

Index(['Marks', 'Grades'], dtype='object')

In [26]:
#adding new column of scaled marks
#scaled marks out of 90 if already existing marks are out of 100 
d['scaledMarks'] = 90*(d['Marks']/100)

In [27]:
d

   Marks  Grades  scaledMarks
a     85     4.0         76.5
b     75     3.5         67.5
c     65     3.0         58.5
d     55     2.5         49.5

In [28]:
del d['scaledMarks']

In [29]:
d

   Marks  Grades
a     85     4.0
b     75     3.5
c     65     3.0
d     55     2.5

In [30]:
#pick the data where marks > 70
g = d[d['Marks']>70]

In [31]:
g

   Marks  Grades
a     85     4.0
b     75     3.5

In [32]:
#NaN or none values created for missing values
a = pd.DataFrame([{'a':1, 'b':4},{'b':-3, 'c':9}])

In [33]:
a

     a  b    c
0  1.0  4  NaN
1  NaN -3  9.0

In [34]:
a.fillna(0) #fills NaN with 0

     a  b    c
0  1.0  4  0.0
1  0.0 -3  9.0

In [35]:
a.dropna? #removes NaN if possible. more efficient
#sklearn works best here

Signature:
a.dropna(
    *,
    axis: 'Axis' = 0,
    how: 'AnyAll | lib.NoDefault' = <no_default>,
    thresh: 'int | lib.NoDefault' = <no_default>,
    subset: 'IndexLabel | None' = None,
    inplace: 'bool' = False,
    ignore_index: 'bool' = False,
) -> 'DataFrame | None'
Docstring:
Remove missing values.

See the :ref:`User Guide <missing_data>` for more on which values are
considered missing, and how to work with missing data.

Parameters
----------
axis : {0 or 'index', 1 or 'columns'}, default 0
    Determine if rows or columns which contain missing values are
    removed.

    * 0, or 'index' : Drop rows which contain missing values.
    * 1, or 'columns' : Drop columns which contain missing value.

    Only a single axis is allowed.

how : {'any', 'all'}, default 'any'
    Determine if row or column is removed from DataFrame, when we have
    at least one NA or all NA.

    * 'any' : If any NA values are present, drop that row or column.
    * 'all' : If all values are NA, drop that row or column.

thresh : int, optional
    Require that many non-NA values. Cannot be combined with how.
subset : column label or sequence of labels, optional
    Labels along other axis to consider, e.g. if you are dropping rows
    these would be a list of columns to include.
inplace : bool, default False
    Whether to modify the DataFrame rather than creating a new one.
ignore_index : bool, default ``False``
    If ``True``, the resulting axis will be labeled 0, 1, …, n - 1.

    .. versionadded:: 2.0.0

Returns
-------
DataFrame or None
    DataFrame with NA entries dropped from it or None if ``inplace=True``.

See Also
--------
DataFrame.isna: Indicate missing values.
DataFrame.notna : Indicate existing (non-missing) values.
DataFrame.fillna : Replace missing values.
Series.dropna : Drop missing values.
Index.dropna : Drop missing indices.

Examples
--------
>>> df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
...                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
...                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
...                             pd.NaT]})
>>> df
       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Drop the rows where at least one element is missing.

>>> df.dropna()
     name        toy       born
1  Batman  Batmobile 1940-04-25

Drop the columns where at least one element is missing.

>>> df.dropna(axis='columns')
       name
0    Alfred
1    Batman
2  Catwoman

Drop the rows where all elements are missing.

>>> df.dropna(how='all')
       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Keep only the rows with at least 2 non-NA values.

>>> df.dropna(thresh=2)
       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Define in which columns to look for missing values.

>>> df.dropna(subset=['name', 'toy'])
       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT
File:      ~/.local/lib/python3.10/site-packages/pandas/core/frame.py
Type:      method

In [37]:
#explicit index and implicit index

In [38]:
a = pd.Series(['a','b','c'], index=[1,3,5])

In [40]:
a[1] #explicit

'a'

In [42]:
a[1:3] #this will access implicit b and c i.e. index 1 & 2

3    b
5    c
dtype: object

In [43]:
a.loc[1:3] #this will make explicit [1:3]

1    a
3    b
dtype: object

In [44]:
a.iloc[1:3] #this will make implicit [1:3]

3    b
5    c
dtype: object

In [45]:
d

   Marks  Grades
a     85     4.0
b     75     3.5
c     65     3.0
d     55     2.5

In [46]:
d.iloc[2,:] #to access 3rd row which has idx 2

Marks     65.0
Grades     3.0
Name: c, dtype: float64

In [48]:
d.iloc[::-1,:] #reverse

   Marks  Grades
d     55     2.5
c     65     3.0
b     75     3.5
a     85     4.0